{    "Articles": [
         {
            "Title": "How Did We Get This Far?",
            "Subtitle": "Youtube Channels, and community watch",
            "Content": "<p>As a special thanks to Chibichanyan, be sure to check out her forum <a style='font-weight:bold;color:hotpink !important' href='http://s1.zetaboards.com/Crimson_Wind_Academy/index/'>Crimsom Wind Academy</a> a Created-Card-Game and Role Play website. They feature a lively and welcoming community the angel of denial herself. Follow the history of the development of Salvation on <a style='font-weight:bold;color:hotpink !important' href='https://www.youtube.com/channel/UCppCc4Ucq1qtj4o7MhBNetg'>AccessDenied's development diary and vlog.</a>. Be sure to check out <a shref='https://www.youtube.com/user/YGOhack137/videos'>YGOHack137</a>'s channel new post to his channel are the advent of updates here. Finally if all our software can be found at <a href='https://github.com/SalvationDevelopment'>https://github.com/SalvationDevelopment</a> please watch and star our projects to learn how we are developing and if you are a developer join in on improving our system! There is a culture section to learn more about upcoming features and our current goals!</p>",
            "Author": "AccessDenied",
            "Date" : "April 18th, 2015th"
        },{
            "Title": "Need News? Need News Now!",
            "Subtitle": "Change Log",
            "Content": "<p>News feed will now update every 120 seconds. You no longer need to close your launcher and restart or go to the site to see the latest news.</p>",
            "Author": "AccessDenied",
            "Date" : "April 18th, 2015th"
        },{
            "Title": "What's the difference between YGOPro Devpro and The YGOPro Salvation Server?",
            "Subtitle": "A History Lesson",
            "Content": "<p>DevPro had internal management issues that ultimately I could not resolve. Basically discrimination and insubordination, it suffered a staff coup like its original birth from TDOANE. It happened in stages and left Benblub singularly in charge. Instead of the majority of the staff having access to the server its been cut down to I would guess max 3 people. Updates seem to be done via FTP and then Ben or Sid manually switches the new updates on. However he has that server configured its security is incompatibly (and always has been) with the way DevPro is built. That is why it crashes and stays off for so long.<br /><br />This is different from Checkmate, Percy and DN where they go offline due to network load or attacks.<br /><br />DevPro has 3 programs that run on the server they are proprietary. A central chat-gamelist-login server, and a core generator and game manager. Finally a ygocore or ygopro game instance with no GUI.<br /><br />The first two programs are points of failure. The ygocore's can error out and confuse the game manager. This causes it to stop producing cores because it spins up 200-500 at a time and manages them recycling them as needed. If the errors out due to the security settings on the server the core does not return to the pool until reviewed. This is fine and great for finding card bugs but doesnt work when no one is watching the server. They update it and go to bed, Salvation updates if cards cause bugs they dont lock the server and everyone working on the project has a decent degree of server access to prevent issues.<br /><br />When it locks up you get the [server is full] bug. When the server restarts or the central program errors it cause the server to reject login. The system isnt configured to restart the process. If a manager goes offline same issue no hosting. Some one has to manually go into the server and restart it. (of few have access)<br /><br /><strong>To push an update out on Devpro all the files have to be gathered and the version of DevPro upticked. This setup encourages waiting and waiting to update.</strong> Salvation uses a non-versioning system and individually checks all 20,000 files in an installation and verifies that you have them and they are within a certain error range, updated. The update runs ever 120 second. So all we ever do is upload changes via git or Dropbox.<br /><br />On Salvation there are 3 programs. A IRC server, a central server, and an opensourced customized version of YGOCore. The central server will file a error report if it crashes and restart itself. It also starts up 4 instances of itself that act as core managers and from there starts ygocore with variable configurations. DevPro is locked to 1 (OCG-with tcg rulings on specific cards) Salvation can make more accurate rulings. The IRC is separate incredibly stable unlike DevPro's custom option and highly documented. We are able to leverage everything that touches IRC due to that included more bots than just [Dev]DevBot, we where able to recreate all of DevPro's customizations also.<br /><br />IRC solves the social issues DN has and some of the ones on DevPro. I intended for DevPro to use IRC but Buttys just built a new chat server its now the main cause of devpros lag. Each user can create their own rooms/teams/clans ad-hoc and at no cost. They set the political climate of those rooms. People that dont want to be near each other dont have to be. You dont even need to install the launcher to access these room. You can have your team on Salvation and play on DN/YGOPro/DevPro.<br /><br />DevPro uses IIS, Salvation uses nginx-apache, DN uses Apache-TomCat, draw your own conclusions if you know what that stuff is.<br /><br /. DevPro is written in C# and PHP, Salvation is written in HTML CSS JavaScript, and now GO. So I can leverage more programmers. Salvation <strong>is</strong>a website. Its launcher is just a stripped down browser with a few special features. It just pulls down http://ygopro.us and responses to http request you make to yourself with the launcher acting as a server that maintains and launches YGOPro. You will notice that increasingly more features will be web accessible. DevPro has this but its not translated well to the interface. Also interface. Look boobies!<br /><br />No devpoint system or anything like it will ever be implemented because it causes people to get upset and abuse the staff. The only pay system we implementing is one that will put bounties on bugs and features the developers here can not fix or implement with thier own skill sets. The system has a refund system also. Someone could file a bug/feature request lobby american congress style and have a rogue coder show up and implement it.<br /><br />DevPro has a policy that stems from god knows where that is basically anarchism. Abusive users may complain on the staff and this usually results in the staff member being removed. So they have increasing dwindling staff like DN. The staff there is scared to act, and to make matters worst all the security I wrote to track user issues was removed. A user pretty much cant be banned and if they are they can very successfully seek revenge. Not that it matter but you have to be VERY highly ranked to even ban, and even then its a ban that cant be enforced beacuse of mismanagement how to remove it got out. Topped with a 'no more than 1 hour' policy making it pointless. I'm pretty sure all the admin actions are logged and will result in review if used. At just a handful its less than or equal to DN's high ranked staff that can even ban for that sad 1 hour. The devpoint system doesnt help much giving the primarily American audience the mentality the volunteers are staff and can complain on them like retail workers. So like DN did to YVD DevPro is slowly turning it once peaceful community into hateful-cancer plaguespreaders.<br /><br />The basic premise is I had a vision for how I wanted YGOPro to work and I took that vision to TDOANE found that I couldnt implement it and left with the people that could help me do that. As they took my engineering ideas because engineering is not programming its a seperate skill they started ignoring my design plans and doing as they pleased and slowly locking me out of engineering and programming via language choice and security access.<br /><br />Salvation is a bit of a revenge project in I am proving that I was right in my designs and how people should be treated. Of the DevPro devs im pretty low on programmer skill, but you can see by the way Salvation is built I have the broadest outlook. The system is VERY far behind the other simulators, TDOANE has far more features, and DevPro vastly more.<br /><br />Revenge for the way my staff was treated. I mean no harm to DevPro but I know how it is ran how it is built and I know it will rot. As far as the management and assiting of keeping YGOPro/DN as a whole upto date we will help DN DevPro Percy and MyCard, but I have my goals. And they are pretty devious. They require going all out for the salvation of the YuGiOh community. I grew up on XC-YVD and DN basically killed the place not from abandonment but by taking the worst elements of YVD and institutionalizing them then killing YVD's culture. I want to get back at basically everyone that has abused the community by turning a blind eye while in administrative power by automating their jobs.<br /><br />If you want a reason for using salvation over devpro, salvation is going somewhere, updates quicker, has a nicer community and is more stable. Our staff is kind and open hearted if not harsh at times. As great as DevPro is I was very stifled in the way I drew up some of the designs so Salvation is my opperitunity to prove I was right and so far it seems I have been.<p/>",
            "Author": "AccessDenied",
            "Date" : "April 18th, 2015th"
        },{
            "Title": "Grace our Duel oh Great Lord of the Sky! I summon thee Winged Dragon of Ra! ",
            "Subtitle": "Change Log",
            "Content": "<p>Newly uploaded cards from YGOHack137, bug fixes by ChibiChanyan and Oneshot.<br /><br />Dragoknight Luster Pendulum<br/>Explosive Dragoknight Ignister Prominence<br/>Mimicat<br />Odd-Eyes Absolute Dragon<br/>The Winged Dragon of Ra – Sphere Mode<br/>Juragedo<br/>Legion the Fiend Jester<br />Anti-Magic Arrows<br/>Multiple Destruction<br/>Sibylla Tarotray<br />Sibylla Ritual<br />Sibyl Arrowsylph<br />Black Cat’s Glare<br />Aqua Actress – Guppi<br />Aqua Actress – Arowana<br />Aquarium Stage<br />Aquarium Lighting<br />Noble Dragon Magician<br />Peasant Dragon Magician<br/>Dragonvein Magician<br/>Dragontrove Magician<br/></p><br /><a style='color:hotpink !important' target='_blank' href='https://www.youtube.com/watch?v=GhaR7bNkT48'> Special thanks to TCGGaming for doing this video about our system.</a> Be sure to link his video <strong>EVERYWHERE</strong>. Thank you TCGGaming for bringing to our attention we need to post patch notes more often. They just take a while to code. Bug in the video is also patched for new installations.<br /><br /> Remember our script files and database text are open to the public to edit, so if you want to help out just let the staff know. Also please do not duel the AI that spontaneously appears. *wink wink* It will banish you.",
            "Author": "AccessDenied",
            "Date" : "April 18th, 2015th"
        },{
            "Title": "New Cards and Login",
            "Subtitle": "Keeping up with new releases with style!",
            "Content": "<p>Added Opera the Melodious Diva, Insight Magician and Performapal Camelose. Expect more in a few days. Repairs to Aromages, Igknights, Hermos, Jewel of Red Stone, Protector of the Shrine, Dark Magician of Chaos, and Odd-Eyes Rebellion Dragon. Credit to <a href='https://www.youtube.com/user/YGOhack137/videos'>YGOHack137</a> DailyShana, and Chibi.<br /> We have a new radio system in development so the developers can push audio to users and you can hear more detailed patch notes. Our card database is being exported to Github so you can edit it yourself if you find a miswording or targeting bug. Our scripts for our server have been made public you can lad fixes on our Github now and they be pushed directly to the server within minutes.</p>",
            "Author": "AccessDenied",
            "Date" : "April 17th, 2015th"
        },{
            "Title": "A Few New Cards",
            "Subtitle": "Keeping up with new releases and Critias!",
            "Content": "<p>Brilliant Fusion, Gem-Knight Lady Brilliant Diamond and Performagician Trick Clown have been added to the server. All Critiad cards are now also fully functional.</p><p><a href='https://www.youtube.com/user/YGOhack137/videos'>Credit goes to YGOHack137 for the new cards</a>, Chibi for the fixes.</p>",
            "Author": "ChibiChanNya",
            "Date" : "April 6th, 2015th"
        },{
            "Title": "Goat Format Anniversary",
            "Subtitle": "Revive this famous period of history!",
            "Content": "<p>Today, 10 years ago began one of the most acclaimed formats in the history of Yu-Gi-Oh! From today on, you can revisit this highly skill-based moment of our history. Switch database to 3-Goats to build a deck using the cards of the time. Afterwards, host duels by selecting the Goats banlist and you'll be set! (Rainbow color on gamelist). Some new cards have been added as well, including Fuzzy Lanius and Fluffal Mouse.</p><p>Credit goes to Storm Wolf for the Goats idea and<a href='https://www.youtube.com/user/YGOhack137/videos'> YGOHack137 for the cards</a></p>",
            "Author": "ChibiChanNya",
            "Date" : "April 1st, 2015th"
        },{
            "Title": "Three New Cards",
            "Subtitle": "Seems We Missed a Few",
            "Content": "<p>Junk Breaker, Kaiser Sea Snake, and Bird of Paradise Lost have been added to the system</p><p><a href='https://www.youtube.com/user/YGOhack137/videos'>Credit goes to YGOHack137</a></p>",
            "Author": "AccessDenied",
            "Date" : "March 22th, 2015th"
        },{
            "Title": "Its Banlist Season!",
            "Subtitle": "Both Banlist are out applying to the server",
            "Content": "<p>The March OCG and TCG list have been applied to the server</p>TCG<br/>Newly Forbidden:<br/>Blaster, Dragon Ruler of Infernos<br/>Redox, Dragon Ruler of Boulders<br/>Tempest, Dragon Ruler of Storms<br/>Tidal, Dragon Ruler of Waterfalls<br/>Snatch Steal<br/>Newly Limited:<br/>Sinister Serpent<br/>Tour Guide From the Underworld<br/>Dragon Ravine<br/>Preparation of Rites<br/>Saqlifice<br/>Symbol of Heritage<br/>Temple of Kings<br/>Crush Card Virus<br/>Exchange of the Spirit<br/>Ring of Destruction<br/>Skill Drain<br/>Vanity's Emptiness<br/> <br/>Newly Semi Limited:<br/>Qliphort Scout<br/>Nekroz of Brionac<br/>Legendary Six Samurai - Shi En<br/>Charge of the Light Brigade<br/>Sacred Sword of Seven Stars<br/><br/>Newly Unlimited<br/>Brotherhood of the Fire Fist -Spirit<br/>Burner, Dragon Ruler of Sparks<br/>Gladiator Beast Bestiari<br/>Gorz the Emissary of Darkness<br/>Lightning, Dragon Ruler of Drafts<br/>Lonefire Blossom<br/>Reactan, Dragon Ruler of Pebbles<br/>Stream, Dragon Ruler of Droplets<br/>Goyo Guardian<br/>Hieratic Seal of Convocation<br/><br/>OCG<br/>Forbidden:<br/>El Shaddoll Construct<br/>Blaster, Dragon Ruler of Infernos<br/>Redox, Dragon Ruler of Boulders<br/>Tempest, Dragon Ruler of Storms<br/>Tidal, Dragon Ruler of Waterfalls<br/><br/>Limited:<br/>Vanity's Emptiness<br/>Saqlifice<br/>Nekroz Cycle<br/>Mathematician<br/>Nekroz of Brionac<br/>Kuribandit<br/>El Shaddoll Fusion<br/>Dark Magician of Chaos<br/><br/>Semi-Limited:<br/>Qliphort Tool<br/>Wind-Up Zenmaity<br/>Formula Synchron<br/>Manju of the Ten Thousand Hands<br/><br/>Unlimited:<br/>El Shaddoll Winda<br/>Inzektor Hornet<br/>Sinister Serpent<br/>Legendary Six Samurai Shi-En<br/>Senju of the Thousand Hands<br/>Archlord Kristya<br/>Number 11: Big Eye<br/>Brotherhood of the Fire Fist - Rooster<br/>Temple of the Kings<br/>Monster Gate<br/>Exchange of the Spirit<br/>Stream, Dragon Ruler of Droplets<br/>Burner, Dragon Ruler of Sparks<br/>Reactan, Dragon Ruler of Pebbles<br/>Lightning, Dragon Ruler of Drafts ",
            "Author": "AccessDenied",
            "Date" : "March 20th, 2015th"
        },{
            "Title": "Toon, Red-eyes, Aromages, and More!",
            "Subtitle": "Update to CORE",
            "Content": "<p>Updates to YGOPro Salvation Server.<br/>Wicked Priest Chilam Sabak</br>Infernity Bishop</br>Gogogo Aristera & Dexia</br>Galaxy Worm</br>Timaeus the Knight of Destiny</br>The Fang of Critias</br>The Claw of Hermos</br>Legendary Knight Critias</br>Legendary Knight Hermos</br>Lord of the Red</br>Red-Eyes Transmigration</br>Toon Ancient Gear Golem</br>Toon Kingdom</br>Aromage - Rosemary</br>Aromage - Bergamot</br>Aromage - Kananga</br>Aromage - Jasmine</br>Aroma Garden</br>D/D Pandora</br>D/D/D Tell the Sniper Overlord</br>D/D/D D''Arc the Oracle Overlord</br>Destruction Magician</br>Creation Magician</br>Odd-Eyes Rebellion Dragon</br>Igknight Burst</br>Ignition Phoenix</br>Igknight Stinger</br>Black Metal Dragon</br>Toon Cyber Dragon</br>Red-Eyes Flare Metal Dragon</br>Return of Red-Eyes</br></p><p><a href='https://www.youtube.com/user/YGOhack137/videos'>Credit goes to YGOHack137</a></p>",
            "Author": "AccessDenied",
            "Date" : "March 17th, 2015th"
        },{
            "Title": "The Monster League has been unleashed!",
            "Subtitle": "Time for some sealed play! BATTLE PACK 3!",
            "Content": "<p>Another update, but this time it's not new cards. It's our new game mode, BATTLE PACK 3: MONSTER LEAGUE! Now Salvation is the only simulator where you can experience the thrills of this unique game format! It is sealed play, so players are restricte to 237 cards total, however, they are all affected by the powerful Monster League Rule: All Monsters are treated as all Types O_O!!</p><p> In order to play, simply make sure Monster League is selected in the 'Card Pool' option when hosting. Deck will be randomized to simulate the opening of packs for sealed.</p>",
            "Author": "ChibiChanNya",
            "Date" : "March 7th, 2015th"
        },{
            "Title": "Igknight and Red-Eye Support",
            "Subtitle": "Set fire to your soul and battle",
            "Content": "<p>New Cards! Watch out for bugs, and if you do see some report them to the forums in the bug section. New cards include:<ul><li>Crystal Rose</li><li>Protector of the Shrine</li><li>Card of Red Jewel</li><li>Ignight Caliber</li><li>Ignight Riot</li><li>Ignight Dragnov</li><li>Ignight Musket</li><li>Ignight Magnum</li><li>Ignight Eagle</li><li>Ignight Advenger</li></ul> Special thanks to YGOHax137 and Chibi Chan Nyan. Server Stablity improvements special thanks to A2. New Forum improments special thanks to CheytheMage and Trinity. Remember to check out our new CasinoBot from Reach!</p><p><a href='https://www.youtube.com/user/YGOhack137/videos'>Credit goes to YGOHack137</a></p>",
            "Author": "AccessDenied",
            "Date" : "March 6th, 2015th"
        },
        {
            "Title": "CasinoBot is live bitches! Join the chat today!",
            "Subtitle": "How brave are you?",
            "Content": "<p>Reach has recently implemented a CasinoBot live to our chat servers! You can check it out by typing '/join #casino' to enter the channel with the Bot. Using the '.help' command will bring up its list of games you play and how much cash you currently have. If you run into any problems with CasinoBot or it's not live in its channel, let Reach know to look into it.</p>",
            "Author": "Reach",
            "Date" : "March 2nd, 2015th"
        },
        {
            "Title": "Korean SECE cards are here!",
            "Subtitle": "Some strange new cards are in",
            "Content": "<p>The 5 unique and...Unique Korea-OCG cards from SECE have been added to the server. They are as follows:<br></p><ul><li>Great Old One Hastur</li><li>Fiendish Rhino Warrior</li><li>Cuben</li><li>Carrot Human</li><li>Rocket Hand</li></ul></p>",
            "Author": "Chibi Chan Nya",
            "Date" : "February 22th 2015"
        },{
            "Title": "Clash of Rebellion has arrived!",
            "Subtitle": "Shiny new cards, report bugs, me midful of ID changes",
            "Content": "<p>Some new cards have been added to the server! All of the recently revealed Clash of Rebellion cards are in. Most of CROS cards had their ID's changed, so If you've been using Zefras, Raidraptors or Performapal, make sure you check your decks!</p> <p><a href='http://ygorganization.com/buymoreraidraptors/'>Newest Cards/a></p><p><a href='https://www.youtube.com/user/YGOhack137/videos'>Credit goes to YGOHack137</a></p>",
            "Author": "Chibi Chan Nya",
            "Date" : "February 17th 2015"
        },{
            "Title": "Most of CROS added",
            "Subtitle": "New cards! But watch out for bugs",
            "Content": "<p>The following cards have been added to the server and can be used after updating. Remember to report bugs in the forum.<br></p><ul><li>Performapal Springoose</li><li>Performapal Hammer Mammoth</li><li>Mithra the Thunder Vassal</li><li>Neptabyss the Atlantean Prince</li><li>An Unexpected Guy</li><li>Fluffal Crane</li><li>Cyber Dragon Infinity</li><li>Chimeratech Rampage Dragon</li><li>Edge Imp Tomahawk</li><li>Frightfur Custom</li><li>Planetellarknight Ptolemaios</li><li>El Shaddoll Anomalilith</li><li>Deskbot 004</li><li>Garm the Storm Vassal</li><li>Infernoid Lilith</li><li>Mud Statue of the Kumonyou</li><li>Yosenju Kodama</li><li>Edge Imp DT Modoki</li><li>Superheavy Samurai Soul Buster Gauntlet</li><li>Performapal Pinch Helper</li><li>Performapal Bowhopper</li><li>Fiendish Hound Octoros</li><li>Madolche Puddingcess Choco A La Mode</li><li>Raid Raptors - Blaze Falcon</li><li>Superheavy Samurai Big Wara-G</li><li>Fire King's Island</li><li>Lucius the Shadow Vassal</li><li>Berlines the Firestorm Vassal</li><li>Grieving Fiend</li><li>Superheavy Samurai Gro-V</li><li>Dizzying Wind of the Yosen Realm</li><li>Yosenju Oyamabiko</li><li>Stitching Reborn</li><li>Performapal Lizardraw</li><li>Pendulum Arise</li><li>Frozen Void</li><li>The True Monarch Dominion</li><li>Pudding Force</li><li>Magma Dragon</li><li>Landrobe the Rock Vassal</li><li>Abyssal Stungray</li><li>Re-Dice</li><li>Jar of Avarice</li></ul><p> Additionally, some ID's may have changed, check your decks. We will be adding the remaining CROS cards as soon as possible!</p> <p><a href='https://www.youtube.com/user/YGOhack137/videos'>Credit goes to YGOHack137</a></p>",
            "Author": "Chibi Chan Nya",
            "Date" : "February 12th 2015"
        },{
            "Title": "Some ID changes today",
            "Subtitle": "Decks and Replays might be damaged!",
            "Content": "<p>Some cleaning up was done to the databases today and a few cards have changed their ID's, which means that they will be removed from all Decks and Replays that contain them. The affected cards are the following.<br></p><ul><li>Madolche Puddingcess Choco A La Mode</li><li>Dark Burning Attack</li><li>Dark Burning Magic</li><li>Dragoons of Draconia</li><li>Eternal Soul</li><li>Ring of Peace</li></ul><p>We apologize for any inconvenience this might have caused, but maintaining accurate IDs is an important task. More ID changes should be coming in the following weeks, mostly concernin the 'Zefram' cards. We will be posting the announcement as soon as it happens, so stay alert!<br></p>",
            "Author": "Chibi Chan Nya",
            "Date" : "February 5th 2015"
        },{
            "Title": "Anime Cards Released",
            "Subtitle": "Salvation releases new series of anime-based cards",
            "Content": "<p>As we post this, a large bulk of over 240 anime cards are reaching our servers and will soon be available to users of the Salvation YGOPro Server by updating their client! It is every single card from the Tag Force games and ONLY those. It will set the foundation for SD's anime set!</p><p>To access these cards, open your SD Launcher, wait for full updates, go to settings, database, and pick <strong>1-Anime</strong>. You'll immediately see the effect in your deck editor. Keep in mind many of these cards were made in a hurry and are likely to contain <strong>many</strong> bugs! We depend on you lovely users testing to be able to find them all. We will be opening a bug report thread right after this so let us know if anything isn't functioning correctly.</p><p> Above all, have fun and enjoy this new feature of the Salvation YGOPro Server! Many of our staff have been pushing for it for over one year now and we are very proud to announce that <strong>anime is here at Salvation.</strong></p><a href='http://forum.ygopro.us/index.php?/topic/17-first-batch-of-anime-cards-is-here/'>",
            "Author": "Chibi Chan Nya",
            "Date" : "January 30th 2015"
        },{
            "Title": "Welcome to Salvation",
            "Subtitle": "A new Yu-Gi-Oh! Simulator",
            "Content": "Welcome to the newest YGOPro Server! This server and its unique launcher are geared at helping the community to heal from years of arguments and power struggles. Help us help the community by spreading the word.",
            "Author": "AccessDenied",
            "Date": "December 1st 2014"
        }
    ]
}
